{
  "name": "Carl Pei",
  "timestamp": "2025-12-30 10:41:52.611247",
  "linkedin": {
    "profile_url": "https://uk.linkedin.com/in/getpeid",
    "all_urls": [
      "https://uk.linkedin.com/in/getpeid"
    ]
  },
  "twitter": {
    "profile_url": "https://twitter.com/getpeid",
    "all_urls": [
      "https://twitter.com/getpeid"
    ],
    "username": "getpeid",
    "user_id": "41777199"
  },
  "instagram": {
    "profile_url": "https://www.instagram.com/getpeid",
    "all_urls": [
      "https://www.instagram.com/getpeid"
    ]
  },
  "image": {
    "filename": "profile_image_carl_pei.jpg",
    "url": "https://upload.wikimedia.org/wikipedia/commons/f/ff/TechCrunch_Disrupt_San_Francisco_2019_-_Day_3_Carl_Pei_cropped.jpeg",
    "title": "Carl Pei - Wikipedia",
    "source": null
  },
  "articles": [
    "https://www.wired.com/story/carl-pei-thinks-the-phone-of-the-future-will-only-have-one-app/",
    "https://www.ft.com/content/2abe33fc-88c5-45b2-8cca-1146d4c5aee3",
    "https://mobilenewscwp.co.uk/news/article/huge-pei-day-nothing-raises-200million-value-1-3-billion/",
    "https://arcticstartup.com/nothing-raises-200-million-series-c/",
    "https://siliconcanals.com/nothing-becomes-unicorn/"
  ],
  "linkedin_posts": [
    {
      "text": "We just closed Community Investment (3). In less than a week we attracted 5,000 investors across 80+ countries, raising over $8M.\n\nMore than 11,000 community investors have now invested over $16M since we started Nothing.\n\nWe take this path of transparency and genuine community collaboration seriously because we believe that we can find a better and more modern way of running companies. We have a community member on the board to share full and transparent feedback every quarter, keeping us close to the ground truth as we scale. On top of that we unveiled Phone (3a) Community Edition this month, a product and campaign built by Nothing fans and for Nothing fans. We also do community fundraising so people don’t have to wait until the IPO (when shares are likely to be way more expensive) to participate in our financial journey. It takes far more effort and resources than raising from institutions, but we believe it’s integral to building a tech company for the next generation.\n\nWe raised a $200 million Series C earlier this year led by Tiger Global. Since then, we've built significant global momentum, and this recent community funding round shows how many people believe in where we're going.\n\nFor 2026, we're launching our most exciting roadmap so far, and I’m proud to have our community on the journey of what's next.",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Nice surprise this morning.\n\nNothing Ear (3) made The Wall Street Journal’s 2025 Holiday Tech Gift Guide. 🎧\n\nOur focus has always been on building products we genuinely enjoy using ourselves, whether that’s consumer audio or smartphones, with design treated as a first-class feature alongside the product's performance.\n\nHuge credit to theteam for staying disciplined and obsessed with detail, and thanks to the WSJ Personal Tech team for the recognition!",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Thanks Nasdaq for the shout-out! \n\nToday we have opened our Community Investment (3) and we’ve already surpassed the initial $5M allocation.\n\nBut it’s never been about the money. It’s about building this together - with people who challenge us, inspire us, and shape this journey with us every step of the way.\n\nMoments like this remind us how special this journey has been. From the earliest days of the company, our community has been at the heart of everything: championing our vision, challenging us to think bigger and helping shape what we’re building 🫶🫂\n\nHere’s to our community, the journey so far and all that’s still to come. We are just getting started, let’s go!",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "We are once again opening up for our community to become shareholders in Nothing!\n\nWe started Nothing to make tech fun and inspire human creativity, but what we set out to do wasn’t easy. I’m convinced one of the biggest reasons we’ve made it this far is because of support from our community. Since Phone (1) in 2022, they’ve kept us grounded, challenged us, celebrated the wins, and helped us through the setbacks.\n\nThe rise of the consumer internet means today that anyone with passion and determination can become an expert in any field. This thinking shaped our Community Board Observer, our Community Edition phones, and now extends to our Series C capital raise.\n\nWe’ve now done one of the hardest things: built a global, scaled, end-to-end capable hardware foundation. With this as a base, we’re focused on what’s next – reinventing consumer hardware in the AI era, starting with tools like Playground and Essential Apps that let anyone create software using natural language. Our community will be at the center of that future.\n\nIf you're interested in helping us build the future, you can find out more on\n\n*Don’t invest unless you’re prepared to lose all the money you invest. This is a high-risk investment and you are unlikely to be protected if something goes wrong.",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Charlie Smith is trading luxury fashion for tech and joining London-based smartphone maker Nothing in January. Previously chief marketing and communications officer at Loewe, he is to oversee all of Nothing’s global brand, image, marketing, communications and store design, reporting to cofounder and chief executive officer. Read more:",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Excited to share that Headphone (1) has been named one of TIME’s Best Inventions 2025! \n\nWith this product, we rethought control itself by replacing touch gestures with a new combination of buttons, roller, and paddle. Each one designed to feel precise, tactile, and intuitive. Because innovation is about rethinking how we interact, and bringing back what makes us feel connected.\n\nHuge thanks to the entireteam for pushing the boundaries of audio and redefining how we experience audio.",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Excited to partner with Nikhil Kamath on the journey as we make tech fun and inspire creativity!",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Back in India this week as part of the UK’s largest trade mission, led by Keir Starmer and joined by 125 founders, CEOs, and cultural leaders. It’s been great to reconnect with the country’s fast-moving tech scene and explore new opportunities to strengthen UK–India collaboration.\n\nIndia has become central to Nothing’s story — not just as a key market, but as a core part of our operations and innovation.\n\n- We recently announced a $100M joint venture with Optiemus Infracom to expand smartphone manufacturing in India. The partnership will create 1,800+ jobs over the next three years and help scale local R&D, design, and production.\n\n- CMF by Nothing is becoming an independent, India-headquartered brand, giving it more freedom to build for local and global audiences from the ground up.\n\n- Our first Nothing flagship store in India later this year.\n\nIndia is one of the most dynamic markets in the world — ambitious, creative, and deeply tech-savvy. Every visit is a reminder of how much innovation is happening here and how much potential there is to build together.\n\n(Can you spot,,,, orin this delegation photo?)",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Excited to announce a brand new update to Essential Space: Call Recording, allowing you to focus and be present in your conversation, while Essential Space remembers the details.\n\nJust long-press the Essential Key to record a call and upload it directly to Essential Space.\n\nAn automatic rollout has already started. No manual update required - it comes to you!\n\nCurrently available across the UK, India, Japan, South Korea, the Philippines, Thailand, Malaysia, and Indonesia with more countries coming soon.\n\nTry it out and let us know what you think!",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Europe has some of the best universities but stopped investing in the youth.\n\nHow do we change this trend?",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Excited to be strengthening our partnership with Rakuten Mobile, Inc., thank you Sharad Sriwastawa and team.",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Very excited about not only manufacturing in India, but also exporting from India to the world.\n\nWatch this space.",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "The fastest-growing smartphone brand in the world last quarter? \n\nNothing, with 177% YoY growth in Q2. \n\nIn a market category that's flat, this is a huge milestone and a testament to what’s possible when bold ideas meet relentless execution.\n\nMassive credit to the team behind it. You made this happen!\n\n(Source: Canalys Q2 2025)",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Q2 2025 has been a massive moment for Nothing in India.\n\nWith 146% YoY growth, we’re once again the fastest growing smartphone brand in the country - for the 6th consecutive quarter. Nothing is the first smartphone brand ever to achieve such consistent, rapid growth.\n\nThe response from India goes far beyond the numbers. It shows up in conversations, feedback, and the growing engagement we see every day. It’s a strong signal that what we’re building truly resonates.\n\nWe’re proud of what we’ve achieved, but we’re far more excited about what comes next.\n\nA big thank you to our team, partners, and the incredible community that’s grown with us.\n\nIndia, we’re building this together. 🇮🇳",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "This week we unveiled our most intelligent smartwatch to date, CMF Watch 3 Pro. The watch, from our sub-brand CMF, is designed for everyday users and casual fitness explorers alike.\n\n♥️ Advanced HR and sleep tracking\n👟 Custom Running Coach, AI-powered training plans (8–16 weeks) with post-workout insights\n✨ ChatGPT integration\n⏺️ Recording transcription, record a meeting and let AI generate notes\n🔆 1.43 inch AMOLED display\n📱 Supported by our newly redesigned Nothing X app\n🔋 13 days of battery life\n\nAdditionally, I’m excited to share that all CMF smartwatches now sync with the redesigned Nothing X app so you can manage your devices, access detailed fitness insights, and keep everything connected in one hub.\n\nCongratulations to all of the teams who worked tirelessly on this project. We are only half way through 2025 but there is still plenty more to come 👀",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Still riding the high from yesterday’s CMF Phone 2 Pro launch in India.\n\nDuring the keynote, we also shared some fresh numbers for Nothing:\n📈 Fastest-growing smartphone brand in India with +156% YoY growth in Q1 2025\n🖐️ 5 consecutive quarters as the fastest-growing brand\n🏆 Only brand in the last 10 years to achieve this milestone in India\n\nIndia is one of the most competitive tech markets anywhere, and this kind of sustained momentum doesn’t happen by accident.\n\nMassive thanks to our team, partners, and the growing community pushing us to be better every day.\n\nWe’re just getting started.\n\n(Source:, India Q1 2025)",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "🚀 Thrilled to see the positive early reviews on CMF Phone 2 Pro, Buds 2, Buds 2 Plus, Buds 2a, and accessories! Don't just take our word for it:\n\n⭐ The Verge: \"Nothing’s second modular phone reinvents the rules.\"\n\n⭐ Wallpaper: \"Bold design and carefully honed value engineering.\"\n\n⭐ T3: \"CMF Phone 2 Pro is almost certainly the best bargain Android phone out there.\"\n\n⭐ Gizmodo: \"The Most Exciting Budget Phone of the Year Might Be CMF Nothing’s Phone 2 Pro.\"",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Had a fantastic time with Nikhil Kamath, Rahul Sharma, and Amit Khatri discussing insights and big opportunities in the tech industry. Thanks for having me, and I'm excited to see the next wave of Indian tech entrepreneurs!",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Big news — Nothing just won 4 Red Dot Design Awards for 2025.\n\n🏆 Ear (open)\n🏆 Phone (2a) Plus Community Edition\n🏆 Phone (3a)\n🏆 Phone (3a) Pro\n\nEvery product we make is designed right here in London — with obsessive attention to detail and a clear point of view. Transparent materials, bold silhouettes, subtle lighting. Nothing is ever random.\n\nThese awards are a huge credit to our design and engineering teams who live and breathe that ethos every day. And to the Nothing community who helped shape the (2a) Plus from the inside out — you nailed it.",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    },
    {
      "text": "Built with you. Round two.\n\nThe Community Edition Project submissions are now closed.\n\nYou helped shape the entries. Now it’s time to choose the ultimate version of Phone (3a). Whether it’s hardware, software or campaign ideas, the winning concepts move forward.\n\nVoting is open and ends tomorrow at 11AM BST\n\nCast your vote:",
      "timestamp": null,
      "url": "https://uk.linkedin.com/in/getpeid/recent-activity/all/",
      "metrics": {
        "likes": 0,
        "comments": 0,
        "shares": 0
      }
    }
  ],
  "twitter_posts": [
    {
      "id": "2003555593538170990",
      "text": "Well written https://t.co/X4jDIclSFR",
      "created_at": "2025-12-23T19:57:32.000Z",
      "edit_history_tweet_ids": [
        "2003555593538170990"
      ],
      "metrics": {
        "retweet_count": 20,
        "reply_count": 11,
        "like_count": 420,
        "quote_count": 0,
        "bookmark_count": 404,
        "impression_count": 86496
      }
    },
    {
      "id": "2002029764945789263",
      "text": "@nothingindia How hard is it to use a more aesthetic image?",
      "created_at": "2025-12-19T14:54:26.000Z",
      "edit_history_tweet_ids": [
        "2002029764945789263"
      ],
      "metrics": {
        "retweet_count": 1,
        "reply_count": 23,
        "like_count": 317,
        "quote_count": 3,
        "bookmark_count": 10,
        "impression_count": 46709
      }
    },
    {
      "id": "1999791678480154827",
      "text": "RT @nothingindia: 🚨 Gates open to Phone (3a) Community Edition 2025 drop in Bengaluru. https://t.co/FXJGWtS7HC",
      "created_at": "2025-12-13T10:41:05.000Z",
      "edit_history_tweet_ids": [
        "1999791678480154827"
      ],
      "metrics": {
        "retweet_count": 21,
        "reply_count": 0,
        "like_count": 0,
        "quote_count": 0,
        "bookmark_count": 0,
        "impression_count": 1
      }
    },
    {
      "id": "1999723865442857215",
      "text": "Nothing Ear (3) made the @WSJ 2025 Holiday Tech Gift Guide.\n\nWe just try to make stuff we actually want to use. Design-led, great sound, and UX innovation.\n\nCredit to the Nothing team for creating such a great product, and thanks to the WSJ Personal Tech crew for the recognition! https://t.co/ZamKXmyjdR",
      "created_at": "2025-12-13T06:11:37.000Z",
      "edit_history_tweet_ids": [
        "1999723865442857215"
      ],
      "metrics": {
        "retweet_count": 29,
        "reply_count": 25,
        "like_count": 399,
        "quote_count": 2,
        "bookmark_count": 7,
        "impression_count": 22682
      }
    },
    {
      "id": "1999457432448159762",
      "text": "Very nice https://t.co/1xKByMiz6B",
      "created_at": "2025-12-12T12:32:54.000Z",
      "edit_history_tweet_ids": [
        "1999457432448159762"
      ],
      "metrics": {
        "retweet_count": 11,
        "reply_count": 7,
        "like_count": 373,
        "quote_count": 0,
        "bookmark_count": 12,
        "impression_count": 25503
      }
    }
  ],
  "instagram_photos": [
    {
      "url": "https://www.instagram.com/getpeid/p/DRwtC7_DGKn/",
      "image_url": "https://instagram.fsyd7-1.fna.fbcdn.net/v/t51.82787-15/588218029_18543620173061452_6051148656716821475_n.heic?stp=dst-jpg_e35_tt6&_nc_cat=106&ig_cache_key=Mzc3ODcxODE5NjQ1NTczNDY0Nw%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjE0NDB4MTgwMC5zZHIuQzMifQ%3D%3D&_nc_ohc=Id1WkNc0Zw0Q7kNvwH0DI8W&_nc_oc=Admohlfpib4Ce-yeAjcpYSivIEbJOfRO41qVs-fAhYmg9HRwulnW4mi0yg1B0d1T9WOSZruwBe9F0rJS-TDABwKQ&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd7-1.fna&_nc_gid=kvv_-ao3DCTr39NqU88bWQ&oh=00_AfmesUHGnv-oMePOljuF85bati-IiOYKsb-Xrr8secajYQ&oe=6958F8FC",
      "caption": null,
      "timestamp": "2025-12-02T12:25:34.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/DRIKpShDB9y/",
      "image_url": "https://instagram.fsyd13-1.fna.fbcdn.net/v/t51.82787-15/581832916_18541206280061452_5367130253472140045_n.jpg?stp=dst-jpegr_e35_tt6&_nc_cat=102&ig_cache_key=Mzc2NzMwNzg5MzA2MzAyNjU1Nw%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjE0NDB4MTQ0MC5oZHIuQzMifQ%3D%3D&_nc_ohc=I2RbqBiX1KYQ7kNvwHxKyG-&_nc_oc=AdlrXN38dSUzTT08YrSvm5brAujYx8stuexD3rdkmWXUKdAr2U5O0ppS3fIBfzbpV4oEd-OqLn895vLd8w_o_KbK&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd13-1.fna&_nc_gid=AepeJPMygO-UZerbDjSYhQ&oh=00_Afm2pOgVpU8msBKDLmAAroqKcCDO2e-x6ShW58HJAWiZXA&oe=6958EB8D",
      "caption": null,
      "timestamp": "2025-11-16T18:35:22.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/nikhilkamathcio/p/DPlVMWYEmee/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.71878-15/602426001_1998525351043512_2511529087545481634_n.jpg?stp=dst-jpg_e15_tt6&_nc_cat=107&ig_cache_key=Mzc5Mzc1Mjg3NzcyNzYyODU5Nw%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjY0MHgxMTM2LnNkci5DMyJ9&_nc_ohc=M83q2OZiafgQ7kNvwEa6EC5&_nc_oc=AdnWOPc4iw3UcbogX3StGii6JpRoPfLqtPyL4O9-62H5Ok-zBkJr5pWbbqgiSZJqIS-B1N04Jvs4XeGcFmvF9iuN&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd8-1.fna&_nc_gid=t37rZkLyadaYkuww-lWX7Q&oh=00_Afk2swZF965mwLuXCV6ATJDolM3Ccv-QpD4mUQD8QvGgBg&oe=6958FC00",
      "caption": null,
      "timestamp": "2025-10-09T09:22:43.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": true
    },
    {
      "url": "https://www.instagram.com/getpeid/p/DOrvhwlDD4y/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.82787-15/550359193_18527235448061452_1653370217945637541_n.heic?stp=dst-jpg_e35_tt6&_nc_cat=109&ig_cache_key=MzcyMzI3ODU0NTA0MTc2Nzk4Ng%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjE0NDB4MTQ0MC5zZHIuQzMifQ%3D%3D&_nc_ohc=ThXbBwQ-ch8Q7kNvwHTkWWX&_nc_oc=AdlIjrX05szlb4H05r9fQ4adxhcTGPSCNorbX0DhZGv-fCqf4IjpZ8r22A1e2BGL0oJPfGnDLgS0VSwOgIjlzZaB&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd8-1.fna&_nc_gid=rIfM54X3mu-UxiAT0ASPIw&oh=00_Afk1VRa9JQ3Jb2FfXKVN-Xf38Nzu-EF1D-I7P-2SaFoqKA&oe=6958FE0A",
      "caption": null,
      "timestamp": "2025-09-17T00:36:52.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/DNlLWRgsUPK/",
      "image_url": "https://instagram.fsyd13-1.fna.fbcdn.net/v/t51.82787-15/536464858_18521329207061452_7106000705508325697_n.jpg?stp=dst-jpegr_e35_tt6&_nc_cat=101&ig_cache_key=MzcwMzQxNjE2Mzc3NDAwNjI0OQ%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjE0NDB4MTQ0MC5oZHIuQzMifQ%3D%3D&_nc_ohc=wqTZWh5RIpIQ7kNvwFK7jcb&_nc_oc=AdkrSwsbHYUpOrzQQMxCp0rxRKhIc-ipVDYmYxyQ834DDf4vjl_CxUzIClCtPOMu0WLPEVhV_UvoJYR-9Wl7jlcf&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd13-1.fna&_nc_gid=3jaaoXrakhS8chMVe2EfVQ&oh=00_AfkW-9pyM0qsip6Ybw41ujeMkvQKsye-acuugur__8KkCw&oe=6958F687",
      "caption": null,
      "timestamp": "2025-08-20T14:53:54.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/DLm8O4dsxHr/",
      "image_url": "https://instagram.fsyd7-1.fna.fbcdn.net/v/t51.29350-15/504374713_1445056253161096_4519928510418969316_n.heic?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkNBUk9VU0VMX0lURU0uaW1hZ2VfdXJsZ2VuLjE0NDB4MTQ0MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd7-1.fna.fbcdn.net&_nc_cat=104&_nc_oc=Q6cZ2QEw-0n4mzKJJq6P6FqSs_CaTTeKIqVFkyokYAK2Kb5ctE-ZaUcyn2V_1NKmpXb6FgCPWNrxlyb748W8TM1kFja5&_nc_ohc=rZDjNCofyjYQ7kNvwHKwQU0&_nc_gid=SFQE3BL2XdUFH0O__pCpwA&edm=APs17CUBAAAA&ccb=7-5&ig_cache_key=MzY2Nzg4Mzg0NDExMjE2MjA5OA%3D%3D.3-ccb7-5&oh=00_AfmRH8ju0FeyL9DdiUMOpWdEjOM8N4rDMJVUTW7wPbW4LQ&oe=695905E3&_nc_sid=10d13b",
      "caption": null,
      "timestamp": "2025-07-02T14:17:30.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/DKZQyYDMhf_/",
      "image_url": "https://instagram.fsyd7-1.fna.fbcdn.net/v/t51.29350-15/503318202_615136917652854_1978626820115737922_n.heic?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkZFRUQuaW1hZ2VfdXJsZ2VuLjEwODB4MTA4MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd7-1.fna.fbcdn.net&_nc_cat=106&_nc_oc=Q6cZ2QFAnHqQUJ0-HAI0ergXQIPDEImxMxgpXnn0ZQ9UTXdKI8rlgj_L397B-uvI1JLU0enJrDVpVGHzM-mHb6dad-R_&_nc_ohc=6LHsobEFFPQQ7kNvwHDayYJ&_nc_gid=NaujjoTSpyHvfcEk3Hocng&edm=APs17CUBAAAA&ccb=7-5&ig_cache_key=MzY0NjAxOTIwMzg3NDU1OTk5OQ%3D%3D.3-ccb7-5&oh=00_Afn_eD1bGks0llasnm2IALBbOJW5-EAM_LX22ou1jIe05g&oe=6959020B&_nc_sid=10d13b",
      "caption": null,
      "timestamp": "2025-06-02T10:16:21.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/DHncQsHOWwT/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/486053700_672930275149003_3612474093587447217_n.heic?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkZFRUQuaW1hZ2VfdXJsZ2VuLjE0NDB4MTQ0MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=107&_nc_oc=Q6cZ2QFDNq6XxoW1DJFPc53GArNWIHejvIliGIZyUdeNaVzzltwaZ1QCxGbjKtADExaok942nDpNKzlgPDUO3EsG-yAp&_nc_ohc=IvVi-yy6DAoQ7kNvwHf_YZC&_nc_gid=Dd9TJbw9Uyo3owkk8zoBWQ&edm=APs17CUBAAAA&ccb=7-5&ig_cache_key=MzU5NTk2NzExOTY1ODQxMzA3NQ%3D%3D.3-ccb7-5&oh=00_AfkoCmsHAyIKPnGkpw_OPGnZIEsWXPdaziCfv_0Q0DaaPA&oe=69590576&_nc_sid=10d13b",
      "caption": null,
      "timestamp": "2025-03-25T08:51:48.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/DF76jzaS3Rt/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/477029913_619661377443823_5404424659584964072_n.heic?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkZFRUQuaW1hZ2VfdXJsZ2VuLjEwODB4MTA4MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=107&_nc_oc=Q6cZ2QHUA7d7saIdHPD-3ZZZf4VHLZ1LGYjyuyjwIY9fyDM5exyyQaBKE_CBGUyS-tT2UkO_zkLwQHrM3_AyahlkNtjX&_nc_ohc=OZRJLrudqJEQ7kNvwFg7LN6&_nc_gid=QForJy6-Sc_ir0HmoSGC-w&edm=APs17CUBAAAA&ccb=7-5&ig_cache_key=MzU2NTcwMTA3NzA3NTE5NDk4OQ%3D%3D.3-ccb7-5&oh=00_AfliwxbhBmKbCKT3ncNVUj4yhTJr60TFPF82SJemi1oqFw&oe=6958F785&_nc_sid=10d13b",
      "caption": null,
      "timestamp": "2025-02-11T14:38:35.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/DEB6nAAyxav/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/471520304_3896863033932441_14968168077083895_n.heic?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkZFRUQuaW1hZ2VfdXJsZ2VuLjk5NngxMDgwLnNkci5mMjkzNTAuZGVmYXVsdF9pbWFnZS5jMiJ9&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QHXNLC1tnrYYwi7L500jk_Pk8BaTq0-jCPHGeeC5Jl7OQ7ngChXsc1nbTEojNyvaUIWts-cxsHM7BM9N0r5vr6i&_nc_ohc=niO7-VQHsqsQ7kNvwFPBsD7&_nc_gid=PSCLBIf3obGmEVX2UNhn7Q&edm=APs17CUBAAAA&ccb=7-5&ig_cache_key=MzUzMTM2MTM0OTYwNTcyNTg3MQ%3D%3D.3-ccb7-5&oh=00_AfnK16BBpuBFMvssS6-mnmnHjcUiR39Nevdgjq5r9gXoKA&oe=6958E7DA&_nc_sid=10d13b",
      "caption": null,
      "timestamp": "2024-12-26T05:31:40.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/C-xWF0cs3HV/",
      "image_url": "https://instagram.fsyd7-1.fna.fbcdn.net/v/t39.30808-6/456047768_18451543342061452_6612074566750603000_n.webp?_nc_cat=105&ig_cache_key=MzQzNjYyNTEzNTIwNzA1NjY0Nw%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjE0NDB4MTQ0MC5zZHIuQzMifQ%3D%3D&_nc_ohc=CQPDYTexMgcQ7kNvwHfBUej&_nc_oc=AdlSLKRfGqWZU6FCeb2eCTT62bfxYLPWKrhhLQeTcyAnTgv3VxwSW16rYoutEAO39-O0X2ylPLKYvYVp62T4-hEu&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd7-1.fna&_nc_gid=CMB8oEE9Evlfe9Rw60LI3g&oh=00_AfmpqbJSSBZR8P8N-Jdx9H4mU2P5cVq6YCyWCJCdME_z7A&oe=6958EEC0",
      "caption": null,
      "timestamp": "2024-08-17T12:27:45.000Z",
      "likes": 0,
      "comments": 0,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/getpeid/p/C89Ox0TM7oN/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/449793085_1065976291608261_1822679683876186747_n.webp?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkNBUk9VU0VMX0lURU0uaW1hZ2VfdXJsZ2VuLjE0NDB4MTQ0MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QGiTzocUJMifM_EeLoi41yIluFlwy6mjualAGZRduPVvLonn7x28leEPrAi8f0thpLGMOpU26_geDbjVpF2Dflk&_nc_ohc=cXi2KlNdTl0Q7kNvwGcdwlj&_nc_gid=l9_rqPR8zWoWj1Wq30oRrw&edm=APs17CUBAAAA&ccb=7-5&ig_cache_key=MzQwMzk0MTg3OTcyNjg4NzU5OQ%3D%3D.3-ccb7-5&oh=00_AflgigTC5Rboy3vFKdb1xMcVkUIrD4FbWd0UAFXBnZHsJg&oe=6958E83F&_nc_sid=10d13b",
      "caption": null,
      "timestamp": "2024-07-03T10:11:57.000Z",
      "likes": 0,
      "comments": 13,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18093738958588275/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/449793085_1065976291608261_1822679683876186747_n.webp?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkNBUk9VU0VMX0lURU0uaW1hZ2VfdXJsZ2VuLjE0NDB4MTQ0MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QEPTCt5k2ll7j1rM6uTPu_tFkGWsjuogwxgbFFNHAHehz7nQE8TmrHjsGEnMxnVYqPnSL37rHk8c6SYT4mqt16X&_nc_ohc=cXi2KlNdTl0Q7kNvwGcdwlj&_nc_gid=V5K2moe0fDKwmyt9bzgMSQ&edm=ALQROFkBAAAA&ccb=7-5&ig_cache_key=MzQwMzk0MTg3OTcyNjg4NzU5OQ%3D%3D.3-ccb7-5&oh=00_Afmy3vrMlk0HCj8k1nVMMOjuP8oiM4C3x3WhHhaHTQgPag&oe=6958E83F&_nc_sid=fc8dfb",
      "caption": "stayforthestoriesofficial",
      "timestamp": "2024-07-03T10:11:56.000Z",
      "likes": 4783,
      "comments": 13,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18062926168823509/",
      "image_url": "https://instagram.fsyd7-1.fna.fbcdn.net/v/t51.82787-15/588218029_18543620173061452_6051148656716821475_n.heic?stp=dst-jpg_e35_tt6&_nc_cat=106&ig_cache_key=Mzc3ODcxODE5NjQ1NTczNDY0Nw%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjE0NDB4MTgwMC5zZHIuQzMifQ%3D%3D&_nc_ohc=Id1WkNc0Zw0Q7kNvwH0DI8W&_nc_oc=Admohlfpib4Ce-yeAjcpYSivIEbJOfRO41qVs-fAhYmg9HRwulnW4mi0yg1B0d1T9WOSZruwBe9F0rJS-TDABwKQ&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd7-1.fna&_nc_gid=_6y2mMaEHBohkGTfjDDoUA&oh=00_Aflj4C-vWFAJ72OWT_gdr2Gm5Cp7lVDverfxSd7g9vweyw&oe=6958F8FC",
      "caption": "stayforthestoriesofficial",
      "timestamp": "2024-07-03T10:11:56.000Z",
      "likes": 4783,
      "comments": 13,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/17894762607113326/",
      "image_url": "https://instagram.fsyd7-1.fna.fbcdn.net/v/t51.82787-15/588218029_18543620173061452_6051148656716821475_n.heic?stp=dst-jpg_e35_tt6&_nc_cat=106&ig_cache_key=Mzc3ODcxODE5NjQ1NTczNDY0Nw%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjE0NDB4MTgwMC5zZHIuQzMifQ%3D%3D&_nc_ohc=Id1WkNc0Zw0Q7kNvwH0DI8W&_nc_oc=Admohlfpib4Ce-yeAjcpYSivIEbJOfRO41qVs-fAhYmg9HRwulnW4mi0yg1B0d1T9WOSZruwBe9F0rJS-TDABwKQ&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd7-1.fna&_nc_gid=eJ2s0dTNeBvGCFqy345uyA&oh=00_Afn73vVFZXpohN78PE4IeesIMx4Lb46yWmfKwecYpGXmlQ&oe=6958F8FC",
      "caption": "Are these really phone 2a’s shots ????",
      "timestamp": "2024-07-03T10:11:56.000Z",
      "likes": 4783,
      "comments": 13,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/17911380396042184/",
      "image_url": "https://instagram.fsyd7-1.fna.fbcdn.net/v/t51.82787-15/588218029_18543620173061452_6051148656716821475_n.heic?stp=dst-jpg_e35_tt6&_nc_cat=106&ig_cache_key=Mzc3ODcxODE5NjQ1NTczNDY0Nw%3D%3D.3-ccb7-5&ccb=7-5&_nc_sid=58cdad&efg=eyJ2ZW5jb2RlX3RhZyI6InhwaWRzLjE0NDB4MTgwMC5zZHIuQzMifQ%3D%3D&_nc_ohc=Id1WkNc0Zw0Q7kNvwH0DI8W&_nc_oc=Admohlfpib4Ce-yeAjcpYSivIEbJOfRO41qVs-fAhYmg9HRwulnW4mi0yg1B0d1T9WOSZruwBe9F0rJS-TDABwKQ&_nc_ad=z-m&_nc_cid=0&_nc_zt=23&_nc_ht=instagram.fsyd7-1.fna&_nc_gid=Iq3M-uFEP1ChJaDdiR4WDQ&oh=00_AfnVZnA531XrKMJ3kYg-EUDfgymUeaj-6KZxb_lbrfP26A&oe=6958F8FC",
      "caption": "So disappointed by using nothing phone 1 there is no service center in navi mumbai pathetic service provided by you guys phone is in rebot mode",
      "timestamp": "2024-07-03T10:11:56.000Z",
      "likes": 4783,
      "comments": 13,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18421013089076031/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/449793085_1065976291608261_1822679683876186747_n.webp?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkNBUk9VU0VMX0lURU0uaW1hZ2VfdXJsZ2VuLjE0NDB4MTQ0MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QEPHqsbFJ9iEqn5iEUXBGjyjBfkADhXxbFNiFgPqBr49t8aMMvP8lhIX6C1wm01LiJEhKhytyBjRHzze7dNvidW&_nc_ohc=cXi2KlNdTl0Q7kNvwGcdwlj&_nc_gid=ii_HMbv5nejWBVGgFy-HkQ&edm=ALQROFkBAAAA&ccb=7-5&ig_cache_key=MzQwMzk0MTg3OTcyNjg4NzU5OQ%3D%3D.3-ccb7-5&oh=00_Afk_C_OiPkgOPb1NnbdtM7Uyyh5-jI30F2QVE0vkYXaYIQ&oe=6958E83F&_nc_sid=fc8dfb",
      "caption": "Hello Carl, why don't you open a branch in Kuwait in the largest mall in the Middle East (The Avenues). I assure you that it will be a successful step.",
      "timestamp": "2024-07-03T10:11:56.000Z",
      "likes": 4783,
      "comments": 13,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18161769253308477/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/449793085_1065976291608261_1822679683876186747_n.webp?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkNBUk9VU0VMX0lURU0uaW1hZ2VfdXJsZ2VuLjE0NDB4MTQ0MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QHitL5T3t1f6GAtWRJC-D-GNYuZIt2z-fuOBrhYFacdSEMyPP6yUpda-2UqrR8Fu4q9pWKs8g1-5C1YuxXYlCMV&_nc_ohc=cXi2KlNdTl0Q7kNvwGcdwlj&_nc_gid=KWzxWk3GPUjx3nBe-t7P0Q&edm=ALQROFkBAAAA&ccb=7-5&ig_cache_key=MzQwMzk0MTg3OTcyNjg4NzU5OQ%3D%3D.3-ccb7-5&oh=00_Afnq3Vf7G6i-MMJ0X4k4yB0YF7O_TUssos5q-ij7P3WEVA&oe=6958E83F&_nc_sid=fc8dfb",
      "caption": "Can I expect a 5 inch compact phone from nothing?? We compact phone lovers waiting.",
      "timestamp": "2024-07-03T10:11:56.000Z",
      "likes": 4783,
      "comments": 13,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18011878043270355/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/449793085_1065976291608261_1822679683876186747_n.webp?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkNBUk9VU0VMX0lURU0uaW1hZ2VfdXJsZ2VuLjE0NDB4MTQ0MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QGMktshNjkti8xEil7DtqTdfHGHs-Buz7ox3sZmUGTRfvPFCV5Q82lv8aMsnU7sRihrdaolxbbSvmIaxqF8sS0O&_nc_ohc=cXi2KlNdTl0Q7kNvwGcdwlj&_nc_gid=1eWrmjeYsv72bh1gjZJv1g&edm=ALQROFkBAAAA&ccb=7-5&ig_cache_key=MzQwMzk0MTg3OTcyNjg4NzU5OQ%3D%3D.3-ccb7-5&oh=00_AfnwQucOrDM6EW-iYZJ1P7wa0-y5UMIZpwfNjetBILXyUg&oe=6958E83F&_nc_sid=fc8dfb",
      "caption": "Ma question Nothing phone",
      "timestamp": "2024-07-03T10:11:56.000Z",
      "likes": 4783,
      "comments": 13,
      "is_video": false
    },
    {
      "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/17860349043143880/",
      "image_url": "https://instagram.fsyd8-1.fna.fbcdn.net/v/t51.29350-15/449793085_1065976291608261_1822679683876186747_n.webp?stp=dst-jpg_e35_tt6&efg=eyJ2ZW5jb2RlX3RhZyI6IkNBUk9VU0VMX0lURU0uaW1hZ2VfdXJsZ2VuLjE0NDB4MTQ0MC5zZHIuZjI5MzUwLmRlZmF1bHRfaW1hZ2UuYzIifQ&_nc_ht=instagram.fsyd8-1.fna.fbcdn.net&_nc_cat=109&_nc_oc=Q6cZ2QGhq8ItgP1FNr-6fSPSgzbSAXzpyPqCSszyZcnvOz9jyI6VI0v2s2rJWFdXVA_cKy2nfYHDfD93Wl97hvb0lzkw&_nc_ohc=cXi2KlNdTl0Q7kNvwGcdwlj&_nc_gid=2iT2Q53IoRzDAtAif_76VQ&edm=ALQROFkBAAAA&ccb=7-5&ig_cache_key=MzQwMzk0MTg3OTcyNjg4NzU5OQ%3D%3D.3-ccb7-5&oh=00_Afmq7uUTq0tZt9wQ-Io4yztjUfT5PUwfPSRzpH4Ntlzr3A&oe=6958E83F&_nc_sid=fc8dfb",
      "caption": "stayforthestoriesofficial",
      "timestamp": "2024-07-03T10:11:56.000Z",
      "likes": 4783,
      "comments": 13,
      "is_video": false
    }
  ],
  "instagram_analysis": {
    "individual_analyses": [
      {
        "photo_number": 1,
        "url": "https://www.instagram.com/getpeid/p/DRwtC7_DGKn/",
        "timestamp": "2025-12-02T12:25:34.000Z",
        "caption": null,
        "analysis": "1. **Activity**: The photo shows two individuals posing in a workspace. They appear to be involved in a professional or entrepreneurial setting, possibly as part of a tech or creative company.\n\n2. **Setting/Environment**: The background includes industrial elements like metal racks and plastic partitions, suggestive of a tech-focused or innovative workspace.\n\n3. **Interests/Hobbies/Lifestyle Indicators**: Their casual yet stylish clothing hints at a modern, creative lifestyle. The presence of tech equipment and industrial design elements suggests a focus on technology and innovation.\n\n4. **Mood/Tone**: The mood is professional yet approachable, with a modern and innovative tone. The environment and attire create a sense of forward-thinking and creativity.\n\n5. **Objects/Activities/Themes**: The setting and their relaxed posture suggest confidence and a collaborative spirit. The industrial and tech elements indicate a passion for technology, creativity, and possibly entrepreneurship."
      },
      {
        "photo_number": 2,
        "url": "https://www.instagram.com/getpeid/p/DRIKpShDB9y/",
        "timestamp": "2025-11-16T18:35:22.000Z",
        "caption": null,
        "analysis": "1. **What the photo shows**: The photo depicts a scene in Venice with boats navigating a canal.\n\n2. **Setting/Environment**: The setting is a Venetian canal lined with historic buildings, suggesting a picturesque and iconic cityscape.\n\n3. **Interests, Hobbies, or Lifestyle Indicators**: The setting indicates an interest in travel and exploration, particularly in culturally rich and historic locations. The presence of watercraft suggests an appreciation for boating or maritime experiences.\n\n4. **Mood or Tone**: The tone is vibrant and lively, with a sense of adventure and discovery. The clear sky and bustling activity create a cheerful and energetic mood.\n\n5. **Objects, Activities, or Themes**: The presence of boats and the Italian flag hints at an appreciation for Italian culture and possibly a cosmopolitan or adventurous lifestyle. The canal suggests a preference for unique and memorable experiences."
      },
      {
        "photo_number": 3,
        "url": "https://www.instagram.com/nikhilkamathcio/p/DPlVMWYEmee/",
        "timestamp": "2025-10-09T09:22:43.000Z",
        "caption": null,
        "analysis": "1. **What the Person is Doing**: The person appears to be engaged in a conversation, possibly being interviewed or speaking in a professional context.\n\n2. **Setting/Environment**: The windowed background suggests an office or indoor professional setting, indicating a business or formal environment.\n\n3. **Visible Interests, Hobbies, or Lifestyle Indicators**: The clothing and demeanor suggest a focus on professionalism and perhaps a career in business or public speaking.\n\n4. **Mood or Tone**: The mood seems serious and contemplative, suggesting the subject is discussing a thoughtful or significant topic.\n\n5. **Personality Traits**: The phrase \"PLAY THE GAME\" implies an interest in strategy, competition, or a pragmatic approach to life and work. This indicates a focus on strategic thinking and possibly a competitive, driven personality."
      },
      {
        "photo_number": 4,
        "url": "https://www.instagram.com/getpeid/p/DOrvhwlDD4y/",
        "timestamp": "2025-09-17T00:36:52.000Z",
        "caption": null,
        "analysis": "1. **Activity/Content**: The photo shows a large digital billboard displaying a congratulatory message from Nasdaq to the tech company \"Nothing\" for raising $200 million in a Series C funding round.\n\n2. **Setting/Environment**: The setting appears to be an urban environment, likely in a commercial district with tall buildings, suggesting a bustling, vibrant, and modern atmosphere.\n\n3. **Interests/Hobbies/Lifestyle**: The focus on a tech company and the significant financial investment hint at an interest in technology, innovation, and business success. This may appeal to individuals who are tech enthusiasts, investors, or those involved in the startup ecosystem.\n\n4. **Mood/Tone**: The mood of the photo is celebratory and optimistic, reflecting business achievement and growth in the tech sector.\n\n5. **Personality Traits**: The theme of the photo suggests a personality that values innovation, entrepreneurship, and perhaps a forward-thinking mindset, oriented towards progress and high-tech ventures."
      },
      {
        "photo_number": 5,
        "url": "https://www.instagram.com/getpeid/p/DNlLWRgsUPK/",
        "timestamp": "2025-08-20T14:53:54.000Z",
        "caption": null,
        "analysis": "1. **Activity**: The photo shows two individuals working at a mobile bar, preparing drinks. It's an outdoor setting, likely on a street.\n\n2. **Setting/Environment**: The bar is compact and creatively designed, possibly shaped like an orange. It features vibrant neon signs and bright lighting, suggesting a lively nightlife atmosphere.\n\n3. **Interests/Hobbies**: The setting indicates an interest in socializing and nightlife culture. The neon signs reflect a modern and trendy ambiance.\n\n4. **Mood/Tone**: The mood is energetic and fun, emphasized by the bright lights and vivid colors. It conveys a sense of excitement and social engagement.\n\n5. **Personality Traits/Themes**: The presence of a scooter and the street-side bar suggest a free-spirited, adventurous personality. The neon signs with phrases like “good vibes” hint at a positive, laid-back attitude towards life."
      },
      {
        "photo_number": 6,
        "url": "https://www.instagram.com/getpeid/p/DLm8O4dsxHr/",
        "timestamp": "2025-07-02T14:17:30.000Z",
        "caption": null,
        "analysis": "1. **What the person is doing or what the photo shows:**\n   - The photo shows a speaker on stage giving a presentation to a large audience. They appear to be discussing audio products, as suggested by the graphics on the screens behind them.\n\n2. **The setting/environment:**\n   - The setting is a large event space or auditorium, likely used for conferences or product launches. It's professionally equipped with lighting and audio systems, creating an immersive environment.\n\n3. **Any visible interests, hobbies, or lifestyle indicators:**\n   - The focus on audio equipment suggests a strong interest in technology and sound, possibly indicating the speaker’s professional involvement in the audio or consumer electronics industry.\n\n4. **The mood or tone of the photo:**\n   - The mood is formal and engaging, with an emphasis on innovation and technology. The atmosphere is professional yet dynamic, aiming to captivate and inform the audience.\n\n5. **Any objects, activities, or themes that reveal personality traits:**\n   - The presence of advanced audio equipment and a professional stage setup indicates traits of professionalism, expertise, and a commitment to quality and innovation. The speaker seems to value communication and sharing knowledge with others."
      },
      {
        "photo_number": 7,
        "url": "https://www.instagram.com/getpeid/p/DKZQyYDMhf_/",
        "timestamp": "2025-06-02T10:16:21.000Z",
        "caption": null,
        "analysis": "1. **What the photo shows**: A group of people is gathered, smiling, and holding a YouTube Gold Play Button award.\n\n2. **Setting/environment**: The setting appears to be indoors, possibly in an office or casual meeting space.\n\n3. **Visible interests, hobbies, or lifestyle indicators**: The YouTube award suggests an interest in content creation and digital media, indicating they are likely involved in a successful YouTube channel.\n\n4. **Mood or tone**: The mood is celebratory and joyful, with everyone smiling and appearing excited about the achievement.\n\n5. **Objects, activities, or themes revealing personality traits**: The Gold Play Button indicates dedication, creativity, and success in reaching a significant milestone. The group dynamic suggests teamwork and collaboration."
      },
      {
        "photo_number": 8,
        "url": "https://www.instagram.com/getpeid/p/DHncQsHOWwT/",
        "timestamp": "2025-03-25T08:51:48.000Z",
        "caption": null,
        "analysis": "1. **What the photo shows**: The image displays several smartphones with illuminated design elements on the back.\n\n2. **Setting/Environment**: The setting is minimalistic and studio-like, with a reflective surface that enhances the sleek and modern appearance of the phones.\n\n3. **Visible interests, hobbies, or lifestyle indicators**: The focus on innovative phone design suggests an interest in technology and modern aesthetics.\n\n4. **Mood or tone of the photo**: The mood is futuristic and sleek, created by the glowing elements and clean backdrop.\n\n5. **Objects, activities, or themes revealing personality traits**: The emphasis on unique phone design and lighting suggests an appreciation for cutting-edge technology and style, possibly valuing innovation and modernity."
      },
      {
        "photo_number": 9,
        "url": "https://www.instagram.com/getpeid/p/DF76jzaS3Rt/",
        "timestamp": "2025-02-11T14:38:35.000Z",
        "caption": null,
        "analysis": "1. **Activity**: The person is riding a camel, which suggests a sense of adventure or exploration.\n\n2. **Setting/Environment**: The setting is a desert landscape, likely at sunset, providing a serene and expansive backdrop.\n\n3. **Interests/Hobbies**: The scene indicates an interest in travel and experiencing different cultures, possibly valuing outdoor activities.\n\n4. **Mood/Tone**: The mood is calm and reflective, with the warm colors of the setting sun adding to a peaceful atmosphere.\n\n5. **Personality Traits**: Riding a camel in this setting suggests openness to new experiences and a desire for cultural immersion or adventure."
      },
      {
        "photo_number": 10,
        "url": "https://www.instagram.com/getpeid/p/DEB6nAAyxav/",
        "timestamp": "2024-12-26T05:31:40.000Z",
        "caption": null,
        "analysis": "1. **What the photo shows**: The photo features a framed note signed by a well-known person, along with a small black-and-white photograph of them.\n\n2. **Setting/Environment**: The setting appears to be indoors, possibly in a personal space like an office or a living room, suggesting a well-kept area for displaying memorabilia.\n\n3. **Interests, Hobbies, Lifestyle Indicators**: The individual likely has an interest in technology or entrepreneurship, as evidenced by the focus on a prominent figure in that field. The framed display indicates appreciation for meaningful memorabilia or connections.\n\n4. **Mood/Tone**: The mood is respectful and reverent, with an emphasis on admiration or inspiration.\n\n5. **Objects, Activities, Themes**: The framed note and photograph point to values such as appreciation for innovation, history, or personal motivation. The care taken in framing also indicates a potential interest in preserving significant memories or inspirations."
      },
      {
        "photo_number": 11,
        "url": "https://www.instagram.com/getpeid/p/C-xWF0cs3HV/",
        "timestamp": "2024-08-17T12:27:45.000Z",
        "caption": null,
        "analysis": "1. **Activity**: The photo shows a person attending a concert or music festival, with a DJ performing on stage.\n\n2. **Setting/Environment**: The environment is vibrant and energetic, characterized by colorful laser lights and a crowded venue. It's likely an indoor event.\n\n3. **Interests/Hobbies**: The person is probably interested in electronic music and nightlife, as indicated by their presence at the DJ event.\n\n4. **Mood/Tone**: The mood is lively and dynamic, with a sense of excitement and energy, captured through the bright, colorful lighting and the crowd's enthusiasm.\n\n5. **Personality Traits**: The themes of music, celebration, and social interaction suggest that the person values fun, enjoys social gatherings, and has an affinity for vibrant, energetic environments."
      },
      {
        "photo_number": 12,
        "url": "https://www.instagram.com/getpeid/p/C89Ox0TM7oN/",
        "timestamp": "2024-07-03T10:11:57.000Z",
        "caption": null,
        "analysis": "1. **What the photo shows**: The image features a bridge during sunrise or sunset, with streetlights on and a calm ambiance.\n\n2. **Setting/environment**: The setting is near a waterfront, with the bridge likely being a well-known landmark. The presence of streetlamps and traffic signals indicates an urban area.\n\n3. **Visible interests, hobbies, or lifestyle indicators**: The photo suggests an interest in architecture, cityscapes, or travel. The timing indicates appreciation for serene and picturesque moments.\n\n4. **Mood or tone of the photo**: The mood is calm and reflective, with the soft lighting creating a peaceful atmosphere.\n\n5. **Objects, activities, or themes revealing personality traits**: The focus on an iconic structure and the time of day suggests a personality that values beauty, tranquility, and perhaps exploration or introspection."
      },
      {
        "photo_number": 13,
        "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18093738958588275/",
        "timestamp": "2024-07-03T10:11:56.000Z",
        "caption": "stayforthestoriesofficial",
        "analysis": "1. **What the photo shows**: The photo captures a view of a bridge, likely taken during sunrise or sunset, evidenced by the soft lighting and colors in the sky.\n\n2. **Setting/Environment**: The setting is urban, with the bridge suggesting a city with significant infrastructure. Streetlights and traffic signals indicate a well-traveled area, possibly near a port or waterfront given the presence of a boat.\n\n3. **Visible Interests, Hobbies, or Lifestyle Indicators**: The focus on the bridge and the urban landscape suggests an interest in architecture, travel, or exploration. The caption \"stayforthestoriesofficial\" implies storytelling or creating memorable experiences.\n\n4. **Mood or Tone**: The photo has a calm and serene mood, emphasized by the gentle light and peaceful setting. The time of day adds a reflective, almost nostalgic tone.\n\n5. **Objects, Activities, or Themes Revealing Personality Traits**: The bridge and urban scenery imply an adventurous and curious personality with a penchant for discovering and appreciating cityscapes. The choice of time (dawn or dusk) suggests a contemplative nature and a love for quiet moments in busy environments."
      },
      {
        "photo_number": 14,
        "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18062926168823509/",
        "timestamp": "2024-07-03T10:11:56.000Z",
        "caption": "stayforthestoriesofficial",
        "analysis": "1. **Activity/Content**: Two individuals are posed together, possibly in a professional or creative context.\n\n2. **Setting/Environment**: The setting appears to be an industrial or tech-themed environment, suggesting a workshop or studio with equipment and technology-related elements.\n\n3. **Interests/Hobbies/Indicators**: The presence of tech and creative elements implies an interest in technology, innovation, and potentially design.\n\n4. **Mood/Tone**: The mood is professional but approachable, suggesting confidence and a forward-thinking attitude.\n\n5. **Objects/Activities/Themes**: The tech and industrial themes, along with the casual yet stylish attire, indicate a modern, innovative, and creative personality, emphasizing a commitment to cutting-edge ideas and design."
      },
      {
        "photo_number": 15,
        "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/17894762607113326/",
        "timestamp": "2024-07-03T10:11:56.000Z",
        "caption": "Are these really phone 2a’s shots ????",
        "analysis": "1. **What the photo shows**: The photo features two individuals standing in what appears to be a tech-oriented environment.\n\n2. **Setting/environment**: The setting has an industrial, creative studio vibe, with equipment and tech materials visible, indicating a focus on innovation or technology.\n\n3. **Visible interests, hobbies, or lifestyle indicators**: The presence of tech equipment and casual attire suggests an interest in technology, creativity, and possibly entrepreneurship.\n\n4. **Mood or tone**: The photo has a professional yet casual tone, hinting at an environment that is both innovative and approachable.\n\n5. **Objects, activities, or themes revealing personality traits**: The industrial and technological elements, combined with the casual dress, indicate a focus on modernity, creativity, and forward-thinking. The caption's question suggests a curiosity about quality or innovation, aligning with a progressive mindset."
      },
      {
        "photo_number": 16,
        "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/17911380396042184/",
        "timestamp": "2024-07-03T10:11:56.000Z",
        "caption": "So disappointed by using nothing phone 1 there is no service center in navi mumbai pathetic service provided by you guys phone is in rebot mode",
        "analysis": "I'm unable to analyze the photo in terms of recognizing individuals, but I can offer insights based on the setting and context:\n\n1. **What the Photo Shows**: The image appears to include two individuals in a professional, industrial-like setting, possibly related to technology or design given the context of the article.\n\n2. **Setting/Environment**: The background features industrial materials and equipment, suggesting a tech or creative workspace. This aligns with a theme of innovation or manufacturing.\n\n3. **Visible Interests/Hobbies/Lifestyle Indicators**: The environment indicates a focus on technology or creative design. The mention of \"Nothing\" in the context suggests involvement with a tech company or product.\n\n4. **Mood/Tone of the Photo**: The photo has a professional and serious tone, likely intended to convey innovation and modernity.\n\n5. **Personality Traits/Interests Revealed**: The setting and attire suggest traits like professionalism and perhaps a focus on technology and design. The context of trying to appeal to Gen Z creatives indicates trend awareness and an aim to be at the cutting edge of tech culture.\n\nOverall, the photo suggests a connection to technology, creativity, and modern design, aiming to present a forward-thinking image."
      },
      {
        "photo_number": 17,
        "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18421013089076031/",
        "timestamp": "2024-07-03T10:11:56.000Z",
        "caption": "Hello Carl, why don't you open a branch in Kuwait in the largest mall in the Middle East (The Avenues). I assure you that it will be a successful step.",
        "analysis": "1. **What the photo shows**: The photo features a view of a large bridge, likely taken during sunset or sunrise, given the lighting.\n\n2. **Setting/Environment**: The setting is urban, near a large body of water, with the bridge prominently visible. The presence of a streetlight and traffic signals suggests it's taken from a city street or waterfront.\n\n3. **Visible Interests, Hobbies, or Lifestyle Indicators**: There’s an interest in travel or architecture, evidenced by the focus on the bridge. The mention of \"The Avenues\" mall in Kuwait in the caption indicates an interest in international business and commerce.\n\n4. **Mood or Tone**: The mood is calm and reflective, captured during a tranquil time of day. It suggests an appreciation for urban landscapes and possibly a moment of contemplation about business ventures.\n\n5. **Personality Traits**: The focus on a prominent bridge and mention of international expansion suggest ambition and a focus on connectivity and growth. The person might be entrepreneurial, valuing opportunities and strategic expansion."
      },
      {
        "photo_number": 18,
        "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18161769253308477/",
        "timestamp": "2024-07-03T10:11:56.000Z",
        "caption": "Can I expect a 5 inch compact phone from nothing?? We compact phone lovers waiting.",
        "analysis": "1. **What the photo shows**: The image captures a bridge, possibly during sunset or sunrise, with streetlights and a traffic light in the foreground.\n\n2. **Setting/Environment**: The setting appears urban, possibly a waterfront location, indicated by the presence of the bridge and nearby waterbody.\n\n3. **Visible interests, hobbies, or lifestyle indicators**: The caption suggests an interest in technology, particularly compact smartphones. The scenic view implies an appreciation for architecture or nature.\n\n4. **Mood or tone**: The photo conveys a calm and serene mood, enhanced by the soft lighting of dusk or dawn.\n\n5. **Objects, activities, or themes revealing personality traits**: The interest in compact phones suggests a preference for minimalism or practicality. The focus on the bridge and natural light may indicate an appreciation for aesthetic and design."
      },
      {
        "photo_number": 19,
        "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/18011878043270355/",
        "timestamp": "2024-07-03T10:11:56.000Z",
        "caption": "Ma question Nothing phone",
        "analysis": "1. **What the photo shows**: The photo captures a view of a large suspension bridge, likely at sunrise or sunset, with streetlights and traffic lights in the foreground.\n\n2. **Setting/environment**: The environment is an urban, waterfront area with infrastructure, suggesting a city setting.\n\n3. **Visible interests, hobbies, or lifestyle indicators**: The focus on architecture and the time of day might indicate an interest in cityscapes, urban exploration, or photography.\n\n4. **Mood or tone**: The soft lighting and calm water create a serene, contemplative mood.\n\n5. **Objects, activities, or themes revealing personality traits**: The emphasis on the bridge and lights points to an appreciation for engineering and design. The artistic capture suggests a creative and observant personality."
      },
      {
        "photo_number": 20,
        "url": "https://www.instagram.com/p/C89Ox0TM7oN/c/17860349043143880/",
        "timestamp": "2024-07-03T10:11:56.000Z",
        "caption": "stayforthestoriesofficial",
        "analysis": "1. **What the photo shows**: The photo captures a bridge, possibly during early morning or late evening, given the lighting and the sky's colors.\n\n2. **Setting/environment**: It's an urban setting near a waterfront, with a visible bridge structure, streetlights, and a traffic signal. The scene suggests a cityscape with elements like a boat docked nearby.\n\n3. **Interests, hobbies, or lifestyle indicators**: The focus on architecture and the waterfront suggests an interest in urban environments, travel, or photography.\n\n4. **Mood or tone**: The mood is calm and peaceful, with soft lighting and a pastel sky, indicating a serene or reflective tone.\n\n5. **Personality traits**: The choice to photograph a bridge and cityscape could reveal an appreciation for engineering, structure, or exploration. The caption \"stayforthestoriesofficial\" implies a narrative or storytelling aspect to the person's interests."
      }
    ],
    "summary": "**Comprehensive Profile Summary:**\n\n1. **Overall Personality Traits and Interests:**\n   - This individual appears to be a well-rounded blend of creativity and professionalism, characterized by their appreciation for technology, innovation, and exploration. They display a strong affinity for modern aesthetics, strategic thinking, and a cosmopolitan lifestyle. Their involvement in tech-related activities and entrepreneurial ventures suggests a forward-thinking and progressive personality.\n   - Interests span across technology, travel, architecture, nightlife, and content creation. This suggests a curious and adventurous nature, with a penchant for both intellectual and experiential pursuits.\n\n2. **Lifestyle and Activities:**\n   - The lifestyle of this individual is dynamic and diverse, involving both professional and recreational activities. They are frequently engaged in technology-centric environments, whether through entrepreneurial endeavors, public speaking, or product launches. Their interest in social currents is evident from their attendance at music festivals and the vibrant nightlife scenes.\n   - There is a noticeable emphasis on travel and exploration, particularly in iconic cultural and historic settings, suggesting a preference for experiences that enrich their cultural understanding and provide inspiration.\n\n3. **Values and Priorities (if evident):**\n   - This individual's values revolve around innovation, creativity, collaboration, and achievement. The frequent depictions of significant professional milestones and celebratory moments indicate a strong focus on growth, both personally and professionally.\n   - There is a recurring theme of appreciation for storytelling and memorable experiences, as seen from their engagement with visual narratives and unique experiences like camel rides in a desert landscape.\n\n4. **Professional or Creative Pursuits:**\n   - Professionally, the individual is heavily embedded in the technology sector, possibly occupying a leadership role in a tech company as evidenced by their interaction with industry awards and speaking engagements.\n   - Their creative pursuits may involve content creation, as suggested by the YouTube Gold Play Button award, pointing to success in digital storytelling or media.\n   - The engagement in strategic discussions and large-scale business achievements implies a robust professional network and influence in their field.\n\n5. **Social Patterns or Themes:**\n   - The photos suggest a balance between professional commitments and social engagements. The presence of groups and the celebration of achievements highlight the importance of teamwork and collaboration in their life.\n   - Social themes depict an individual who enjoys vibrant and communal environments, whether in bustling urban settings, festive activities, or relaxed moments with colleagues, emphasizing a sociable and inclusive nature.\n\n6. **Notable Characteristics or Patterns Across the Photos:**\n   - A consistent theme across",
    "total_photos_analyzed": 20
  },
  "text_prompt": "You're a dynamic tech entrepreneur and content creator with a passion for innovation, travel, and vibrant social experiences.",
  "search_completed": true,
  "scrape_completed": true
}